Основная архитектура для работы в сети - клиент-серверная. Клиентом может выступать браузер и любая другая программа, которая отправляет запросы на сервер. История этой главы о том как реализуются веб-клиенты и веб-серверы на Python.
## веб-клиенты
### стандартные библиотеки
В питоне третьей версии есть два встроенных пакета, которые работают с http и клиент-серверной архитектурой:
- urllib - работает на основе HTTP и способен строить скрипты, как для серверов, так и для клиентов.
- http - не до конца изучал чем конкретно этот пакет управляет.
Чтобы написать клиент можно воспользоваться скриптом на питоне, который будет отправлять запрос к ресурсу и получать ответ:
```Python
import urllib.request


resp = urllib.request.urlopen('http://www.example.com/')
print(resp)
print(resp.status)
```
Переменная `resp` вернет объект `HTTPResponse` и мы можем обратиться к этому объекту, чтобы получить, например, статус-код. Фишка в том, что как раз в этом объекте будет содержаться вся информация от нашего запроса к тестовому сайту. Эту информацию мы можем получить с помощью специальных методов и атрибутов объекта. А еще мы можем получить сам HTML документ, который нам прислали вместе с ответом на запрос; только этот документ придется сначала расшифровать, потому что он возвращается в типе данных `bytes`.
```Python
import urllib.request


resp = urllib.request.urlopen('http://www.example.com/')
print(resp.getheaders())

data = resp.read()
data = data.decode('utf-8'))
print(data[:50])
```
`data[:50]` возвращает первые 50 символов из HTML документа.
### сторонние пакеты
Для всех вопросов, которые возникают при решении веб-клиентских проблем, можно использовать стороннюю библиотеку requests. Но сначала ее нужно установить.
```Python
import requests


resp = requests.get('http://www.example.com/')
print(resp)
print(resp.status_code)
print(resp.text[:50])
```
Я хочу написать программу, которая будет отправлять запрос на API интернет-архива и возвращать все записи, которые у них есть по ключевому слову.
```Python
import sys
import requests


def search(title: str) -> dict:
	url = "http://archive.org/advancedsearch.php"
	params = {
		"q": f"title:({title})",
		"output": "json",
		"rows": 50,
		"page": 1
	}
	resp = requests.get(url, params=params)
	return resp.json()


if __name__ == "__main__":
	title = sys.argv[1]
	data = search(title)
	docs = data['response']['docs']
	print(f'Found {len(docs)} items, showing first 10!')
	for row in docs[:10]:
		print(row['identifier'], row['title'], sep='\t')
```
`sys.argv[1]` - это интересный моментик, потому что по сути эта строка позволяет нам запустить прогу на питоне с аргументом из командной строки - эта штука считывает аргументы командной строки.
```Bash
python ia.py red
```
red - это ключевое слово, по которому я хочу искать информацию в архиве, а ia.py это название скрипта, который я написал.
## веб-сервер
### встроенный python-сервер
Веб-сервер в сущности это программа, которая может принимать запросы клиентов и отвечать на них. Сервером называется и эта штука и буквальный физический сервер. Фишка в том, что на физическом сервере может стоять сразу несколько веб-серверов.
Запустить простейший Python-сервер можно командой:
```Bash
python -m http.server
```
Далее появится надпись:
```Bash
Serving HTTP on 0.0.0.0 port 8000 (http://0.0.0.0:8000/) ...
```
Это означает, что этот сервер будет принимать запросы по порту 8000 и адресу `localhost` или `127.0.0.1`. Что означает `0.0.0.0`? Этот адрес не используется ни для одного сервиса, а когда его пишет сервер, то это означает, что запросы на этот сервер могут отправлять только локальные программы.
Если в браузере перейти по адресу `http://localhost:8000`, то можно попасть в папку из которой был запущен сервер и походить по содержимому компьютера; при этом взаимодействие будет происходить именно через сервер, поэтому в консоли, откуда он был вызван будет появляться отчеты о вызове типа такого:
```Bash
127.0.0.1 - - [31/Mar/2025 21:30:10] "GET / HTTP/1.1" 200 -
```
### сторонние решения
Очевидно, что нельзя использовать встроенный веб-сервер для реального проекта - с нагрузкой он не справиться. Для реальных проектов были реализованы свои решения - Apache и Nginx, например. Я напишу о них отдельно. Здесь же стоит только знать, что в сущности эти веб-сервера принимают запросы пользователей и отдают их в WSGI.
### WSGI
Что это такое? Web Server Gateway Interface. Прога, которая толкнула разработку на Python дальше положенного. В сущности это посредник между веб-сервером и бэкендом (то есть вашими скриптами на питоне). До появления WSGI существовал еще CGI (Common Gate Interface), однако последний каждый раз при новом обращении к программе запускал ее заново, что было лишним расходом времени. Чтобы исправить ситуацию разработчики встраивали модули с основой языка программирования в сам веб-сервер, чтобы он мог быстрее обрабатывать запросы. Например, у Apache существовало дополнение в виде mod_python.